Documents/УправлениеТарифами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>УправлениеТарифами</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ТарифыУслугПодробно</xr:Item>
				<xr:Item>InformationRegister.Тарифы</xr:Item>
				<xr:Item>InformationRegister.ТарифыПороговые</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Тарифы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифаПоНорме</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСтимулирующегоТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСтимулирующегоТарифаПоНорме</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифаЛьгота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифаПоНормеЛьгота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТарифыУслугПодробно</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УслугаПодробно</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиСДПТПодробно</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСтимулирующегоТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифаЛьгота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТарифыПороговые</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порог</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПорогиТарифовУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПорога</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСтимулирующегоТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УправлениеТарифами/Ext/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаУправлениеТарифами, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
    Запрос.Текст =
		 "ВЫБРАТЬ
		 |	УправлениеТарифамиТарифы.Ссылка.Организация,
		 |	УправлениеТарифамиТарифы.Ссылка.Здание,
		 |	УправлениеТарифамиТарифы.Ссылка.Дата КАК Период,
		 |	УправлениеТарифамиТарифы.ВидТарифа,
		 |	УправлениеТарифамиТарифы.ЗначениеТарифа,
		 |	УправлениеТарифамиТарифы.Услуга,
		 |	УправлениеТарифамиТарифы.НормаПотребления,
		 |	УправлениеТарифамиТарифы.ЗначениеТарифаПоНорме,
		 |	УправлениеТарифамиТарифы.ЗначениеСтимулирующегоТарифа,
		 |	УправлениеТарифамиТарифы.ЗначениеСтимулирующегоТарифаПоНорме,
		 |	УправлениеТарифамиТарифы.ЗначениеТарифаЛьгота,
		 |	УправлениеТарифамиТарифы.ЗначениеТарифаПоНормеЛьгота
		 |ИЗ
		 |	Документ.УправлениеТарифами.Тарифы КАК УправлениеТарифамиТарифы
		 |ГДЕ
		 |	УправлениеТарифамиТарифы.Ссылка = &Ссылка
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	УправлениеТарифамиТарифыУслугПодробно.Ссылка.Организация,
		 |	УправлениеТарифамиТарифыУслугПодробно.Ссылка.Здание,
		 |	УправлениеТарифамиТарифыУслугПодробно.Ссылка.Дата КАК Период,
		 |	УправлениеТарифамиТарифыУслугПодробно.Услуга,
		 |	УправлениеТарифамиТарифыУслугПодробно.УслугаПодробно,
		 |	УправлениеТарифамиТарифыУслугПодробно.ЗначениеТарифа,
		 |	УправлениеТарифамиТарифыУслугПодробно.ЗначениеСтимулирующегоТарифа,
		 |	УправлениеТарифамиТарифыУслугПодробно.ЗначениеТарифаЛьгота
		 |ИЗ
		 |	Документ.УправлениеТарифами.ТарифыУслугПодробно КАК УправлениеТарифамиТарифыУслугПодробно
		 |ГДЕ
		 |	УправлениеТарифамиТарифыУслугПодробно.Ссылка = &Ссылка
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	УправлениеТарифамиТарифыПороговые.Ссылка.Организация,
		 |	УправлениеТарифамиТарифыПороговые.Ссылка.Здание,
		 |	НАЧАЛОПЕРИОДА(УправлениеТарифамиТарифыПороговые.Ссылка.Дата, МЕСЯЦ) КАК Период,
		 |	УправлениеТарифамиТарифыПороговые.Услуга,
		 |	УправлениеТарифамиТарифыПороговые.ВидТарифа,
		 |	УправлениеТарифамиТарифыПороговые.Порог,
		 |	УправлениеТарифамиТарифыПороговые.ЗначениеПорога,
		 |	УправлениеТарифамиТарифыПороговые.ЗначениеТарифа,
		 |	УправлениеТарифамиТарифыПороговые.ЗначениеСтимулирующегоТарифа
		 |ИЗ
		 |	Документ.УправлениеТарифами.ТарифыПороговые КАК УправлениеТарифамиТарифыПороговые
		 |ГДЕ
		 |	УправлениеТарифамиТарифыПороговые.Ссылка = &Ссылка
		 |	И УправлениеТарифамиТарифыПороговые.ЗначениеПорога <> 0";
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаУправлениеТарифами);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаТарифы", РезультатЗапроса[0].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаТарифыУслугПодробно", РезультатЗапроса[1].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаТарифыПороговые", РезультатЗапроса[2].Выгрузить());
	
КонецПроцедуры
